TexasInstruments/open-pru/examples/pru_i2s/pru_i2s_app/am263x-cc/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263x_beta" --part "AM263x" --package "ZCZ" --context "r5fss0-0" --product "OPEN_PRU@07.03.01" --product "MCU_PLUS_SDK_AM263x@10.02.00"
 * @v2CliArgs --device "AM2634" --package "NFBGA (ZCZ)" --context "r5fss0-0" --product "OPEN_PRU@07.03.01" --product "MCU_PLUS_SDK_AM263x@10.02.00"
 * @versions {"tool":"1.25.0+4268"}
 */

/**
 * Import the modules used in this configuration.
 */
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
const i2c             = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1            = i2c.addInstance();
const pruicss         = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1        = pruicss.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const mpu_armv77      = mpu_armv7.addInstance();
const mpu_armv78      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();
const section13       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
gpio1.$name          = "CONFIG_GPIO_DEBUG0";
gpio1.pinDir         = "OUTPUT";
gpio1.rx             = true;
gpio1.GPIO_n.$assign = "EPWM0_A";

gpio2.$name          = "CONFIG_GPIO_DEBUG1";
gpio2.pinDir         = "OUTPUT";
gpio2.rx             = true;
gpio2.GPIO_n.$assign = "EPWM0_B";

i2c1.$name           = "CONFIG_I2C2";
i2c1.enableIntr      = false;
i2c1.I2C.$assign     = "I2C2";
i2c1.I2C.SCL.$assign = "UART0_RTSn";
i2c1.I2C_child.$name = "drivers_i2c_v1_i2c_v1_template0";

pruicss1.$name                                                           = "CONFIG_PRU_ICSS0";
pruicss1.instance                                                        = "ICSSM0";
pruicss1.AdditionalICSSSettings[0].$name                                 = "CONFIG_PRU_ICSS_IO0";
pruicss1.AdditionalICSSSettings[0].PruGPIO.create(1);
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].$name                      = "CONFIG_PRU_ICSS_GPIO0";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO5.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO6.rx    = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO6.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO4.rx    = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO4.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO0.rx    = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO0.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO1.rx    = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO1.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO2.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO3.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO5.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO6.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO4.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO0.rx    = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO0.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO1.rx    = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO1.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO2.rx    = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO2.$used = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO3.rx    = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO3.$used = true;
pruicss1.intcMapping.create(6);
pruicss1.intcMapping[0].$name   = "CONFIG_PRU_I2S_PRU0_TX";
pruicss1.intcMapping[0].event   = "18";
pruicss1.intcMapping[0].channel = "2";
pruicss1.intcMapping[1].$name   = "CONFIG_PRU_I2S_PRU0_RX";
pruicss1.intcMapping[1].event   = "19";
pruicss1.intcMapping[1].channel = "3";
pruicss1.intcMapping[2].$name   = "CONFIG_PRU_I2S_PRU0_ERR";
pruicss1.intcMapping[2].event   = "20";
pruicss1.intcMapping[2].channel = "4";
pruicss1.intcMapping[3].$name   = "CONFIG_PRU_I2S_PRU1_TX";
pruicss1.intcMapping[3].event   = "21";
pruicss1.intcMapping[3].channel = "5";
pruicss1.intcMapping[4].$name   = "CONFIG_PRU_I2S_PRU1_RX";
pruicss1.intcMapping[4].event   = "22";
pruicss1.intcMapping[4].channel = "6";
pruicss1.intcMapping[5].$name   = "CONFIG_PRU_I2S_PRU1_ERR";
pruicss1.intcMapping[5].event   = "23";
pruicss1.intcMapping[5].channel = "7";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

