TexasInstruments/open-pru/examples/pru_i2s/pru_i2s_app/am263x-cc/r5fss0-0_freertos/example.syscfg
section11.$name                       = "CONFIG_SECTION0";
section11.group                       = false;
section11.load_memory                 = "OCRAM_256K3_RAM";
section11.output_section.create(1);
section11.output_section[0].$name     = ".PruI2s1RxPingPongBuf";
section11.output_section[0].alignment = 0;

section12.$name                       = "CONFIG_SECTION1";
section12.group                       = false;
section12.load_memory                 = "OCRAM_256K4_RAM";
section12.output_section.create(1);
section12.output_section[0].$name     = ".TxBuf";
section12.output_section[0].fill      = 2863329520;
section12.output_section[0].alignment = 0;

section13.$name                        = "CONFIG_SECTION2";
section13.group                        = false;
section13.load_memory                  = "OCRAM_256K4_RAM";
section13.output_section.create(1);
section13.output_section[0].fill       = 1431655765;
section13.output_section[0].$name      = ".RxBuf";
section13.output_section[0].macro_name = "RXBUF_SECTION";
section13.output_section[0].alignment  = 0;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
i2c1.I2C.SDA.$suggestSolution                                                       = "UART0_CTSn";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.$suggestSolution                = "ICSSM";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO5.$suggestSolution = "PR0_PRU0_GPIO5";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO6.$suggestSolution = "PR0_PRU0_GPIO6";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO4.$suggestSolution = "PR0_PRU0_GPIO4";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO0.$suggestSolution = "PR0_PRU0_GPIO0";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO1.$suggestSolution = "PR0_PRU0_GPIO1";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO2.$suggestSolution = "PR0_PRU0_GPIO2";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU0_GPIO3.$suggestSolution = "PR0_PRU0_GPIO3";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO5.$suggestSolution = "PR0_PRU1_GPIO5";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO6.$suggestSolution = "PR0_PRU1_GPIO6";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO4.$suggestSolution = "PR0_PRU1_GPIO4";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO0.$suggestSolution = "PR0_PRU1_GPIO0";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO1.$suggestSolution = "PR0_PRU1_GPIO1";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO2.$suggestSolution = "PR0_PRU1_GPIO2";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].ICSSM.PR0_PRU1_GPIO3.$suggestSolution = "PR0_PRU1_GPIO3";
